/* Error string for OTR message string */
"A private conversation could not be set up." = "Приватный разговор не может быть установлен.";

/* Title for the about page */
"About" = "О программе";

/* Label for button to show version numbers and licenses */
"About This Version" = "Об этой версии";

/* SSL error message */
"Access denied" = "Нет доступа";

/* The string describing a buddy's account */
"Account" = "Учетная запись";

/* Title for the accounts tab */
"Accounts" = "Учетные записи";

/* Button title to add someone as a buddy */
"Add" = "Добавить";

/* The title for the view to add a buddy */
"Add Buddy" = "Добавить контакт";

/* Label for button to create account by logging into an existing account */
"Add Existing Account" = "Add Existing Account";

/* String to describe advanced set of settings */
"Advanced" = "Дополнительно";

/* No comment provided by engineer. */
"Advanced Encryption Settings" = "Advanced Encryption Settings";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "Ошибка шифрования, сообщение не отправлено";

/* SSL error message */
"Attempt to restore an unknown session" = "Попытка восстановить неизвестную сессию";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Автоматическое удаление";

/* Label in buddy list for users that are available */
"Available" = "Доступен";

/* Label in buddy list for users that are away */
"Away" = "Отошел";

/* SSL error message */
"Bad certificate format" = "Неверный формат сертификата";

/* SSL error message */
"Bad MAC" = "Неверный MAC";

/* SSL error message */
"Bad protocol version" = "Неверная версия протокола";

/* SSL error message */
"Bad SSLCipherSuite" = "Неверный набор алгоритмов шифрования";

/* SSL error message */
"Bad unsupported cert format" = "Неподдерживаемый формат сертификата";

/* string to describe basic set of settings */
"Basic" = "Основное";

/* username section */
"Basic Setup" = "Basic Setup";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Так как содержимое базы данных зашифровано Вашей парольной фразой, вы потеряли доступ к данным и должны удалить и переустановить ChatSecure для продолжения. Менеджеры паролей, такие как 1Password или MiniKeePass могут помочь в генерации и хранении сложных паролей.";

/* No comment provided by engineer. */
"Best Available" = "Best Available";

/* The String for a button to block a buddy */
"Block" = "Блокировать";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Блокировать и удалить";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Информация";

/* Cancel an alert window */
"Cancel" = "Отмена";

/* Error string for OTR message string */
"Cannot read the received message." = "Невозможно прочитать полученное сообщение";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Невозможно определить тип шифрованного сообщения";

/* SSL error message */
"Cert chain not verified by root" = "Цепочка сертификатов не проверена";

/* SSL error message */
"Certificate expired" = "Сертификат просрочен";

/* SSL error message */
"Certificate revoked" = "Сертификат отозван";

/* SSL error message */
"Chain had a cert not yet valid" = "Цепочка содержит неверный сертификат";

/* SSL error message */
"Chain had an expired cert" = "Цепочка содержит просроченный сертификат";

/* Title for chat view */
"Chat" = "Чат";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Беседуй со мной безопасно";

/* Title for chats view */
"Chats" = "Чаты";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Исходный код доступен на Github";

/* server selection footer */
"Choose from our list of trusted servers, or use your own." = "Choose from our list of trusted servers, or use your own.";

/* title for server selection screen */
"Choose Server" = "Choose Server";

/* SSL error message */
"Cipher Suite negotiation failure" = "Ошибка обмена наборами алгоритмов шифрования";

/* Label for text field where you compose a new message */
"Compose" = "Новое сообщение";

/* SSL error message */
"Configuration error" = "Ошибка конфигурации";

/* String for button to connect connect */
"Connect" = "Connect";

/* Whether or not account is logged in */
"Connected" = "Подключено";

/* String to state if an account is progress of creating a connection */
"Connecting" = "Соединение";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "Подключение к Tor";

/* SSL error message */
"Connection closed gracefully" = "Соединение корректно завершено";

/* SSL error message */
"Connection closed via error" = "Соединение завершено с ошибкой";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Копировать";

/* No comment provided by engineer. */
"Could not decrypt database. If the app is not working properly, you may need to delete and reinstall." = "Could not decrypt database. If the app is not working properly, you may need to delete and reinstall.";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Не удается получить публичный ключ";

/* No comment provided by engineer. */
"Crash Detected" = "Crash Detected";

/* Title for button to create account */
"Create" = "Создать";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Создать новую учетную запись";

/* Start of sentence that will be followed by names */
"Created by" = "Создано";

/* Title for progress of creating a new account */
"Creating Account" = "Создание аккаунта";

/* Place holder label for custom domains */
"Custom" = "Custom";

/* if you want to change your username */
"Customize Username" = "Customize Username";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* SSL error message */
"Decoding error" = "Ошибка декодирования";

/* SSL error message */
"Decompression failure" = "Ошибка распаковки";

/* SSL error message */
"Decryption error" = "Ошибка расшифровки";

/* SSL error message */
"Decryption failed" = "Не удалось расшифровать";

/* SSL error message */
"Decryption failure" = "Расшифрование неудачно";

/* default string to revert to normal language behaviour */
"Default" = "По умолчанию";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Удалить аккаунт?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Удаление чатов при отключении";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Доставлено";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Не беспокоить";

/* No comment provided by engineer. */
"Don't change these unless you really know what you're doing. By default we will always select the best available encryption method." = "Don't change these unless you really know what you're doing. By default we will always select the best available encryption method.";

/* Title for donation link */
"Donate" = "Пожертвовать";

/* Title for button to press when user is finished */
"Done" = "Готово";

/* The string describing account name or email address for a buddy */
"Email" = "Email";

/* enable permission */
"Enable" = "Enable";

/* button for enabling push messages */
"Enable Push" = "Enable Push";

/* button for enabling push messages in iOS system settings */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment provided by engineer. */
"Enable Tor" = "Enable Tor";

/* Generic title for encryption errors */
"Encryption Error" = "Ошибка шифрования";

/* The placeholder text for the text field to enter a group chat name or label */
"Enter a group name" = "Enter a group name";

/* Title of error message pop-up box */
"Error" = "Error";

/* title label for error when creating account */
"Error Creating Account" = "Ошибка создания аккаунта";

/* SSL error message */
"Export restriction" = "Ограничение экспорта";

/* Default message when a user status is set to extended away */
"Extended Away" = "Недоступен";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Не удалось подключиться к серверу. Проверьте учетные данные, интернет-соединение и повторите попытку.";

/* SSL error message */
"Fatal alert" = "Фатальное предупреждение";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Забыли парольную фразу?";

/* whether or not we should generate a strong password for them */
"Generate Secure Password" = "Generate Secure Password";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* The title for the view to enter a group chat name or label */
"Group Name" = "Group Name";

/* SSL error message */
"Handshake failure" = "Ошибка рукопожатия";

/* Label for button to open link to translate app */
"Help Translate" = "Помощь в переводе";

/* Label for button to hold to record audio */
"Hold to talk" = "Hold to talk";

/* Label text for hostname field on login scree */
"Hostname" = "Хост";

/* SSL error message */
"I/O would block (not fatal)" = "Ввод будет заблокирован (не фатально)";

/* SSL error message */
"Illegal parameter" = "Неверный параметр";

/* Label for incoming data transfers */
"Incoming" = "Incoming";

/* Short for information, button title to get more information */
"Info" = "Инфо";

/* SSL error message */
"Insufficient buffer provided" = "Недостаточный размер буфера";

/* SSL error message */
"Insufficient security" = "Недостаточно безопасно";

/* SSL error message */
"Internal error" = "Внутренняя ошибка";

/* SSL error message */
"Invalid certificate chain" = "Неверная цепочка сертификатов";

/* title label for invalid email */
"Invalid Email" = "Неверный e-mail";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "XMPP (Jabber)";

/* Label for button after to send push notification knock. Like knocking on a door */
"Knock" = "Knock";

/* Text for label after knock is sent. Like knocking on a door */
"Knock Sent" = "Knock Sent";

/* string to bring up language selector */
"Language" = "Язык";

/* log in to account */
"Log In" = "Войти";

/* log out from account */
"Log Out" = "Выйти";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Подключаться автоматически";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "Настройка ChatSecure Push";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Управление сохраненными сертификатами";

/* No comment provided by engineer. */
"Me" = "Me";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Сообщение не было отправлено, потому что собеседник завершил приватный разговор. Мы должны завершить соединение или восстановить его";

/* microphone permission is disabled */
"Microphone Disabled" = "Microphone Disabled";

/* SSL error message */
"Miscellaneous bad certificate" = "Неверный сертификат";

/* SSL error message */
"Module attach failure" = "Ошибка подключения модуля";

/* Your QR code */
"My QR Code" = "My QR Code";

/* The string describing a buddy's display name */
"Name" = "Имя";

/* For a new settings value */
"New" = "Новый";

/* Title for New Account View */
"New Account" = "Новая учетная запись";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "Новый сертификат";

/* Label for button to go to next step */
"Next" = "Дальше";

/* for choosing your XMPP vCard display name */
"Nickname" = "Nickname";

/* SSL error message */
"No Error" = "Нет ошибки";

/* SSL error message */
"No renegotiation allowed" = "Возобновление запрещено";

/* Label in buddy list for users that are offline */
"Offline" = "Не в сети";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Старый";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Открыть в Chrome";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Открыть в Facebook";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Открыть в Twitter";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Необязательно";

/* Title for other miscellaneous settings group */
"Other" = "Другое";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "Наша политика требует шифрования, но мы пытаемся отправить нешифрованное сообщение";

/* Label text for password field on login screen */
"Password" = "Пароль";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "Сертификат удаленной стороны корректен либо проигнорирован если проверка отключена";

/* SSL error message */
"Peer dropped connection before responding" = "Удаленная сторона сбросила соединение";

/* SSL error message */
"Peer host name mismatch" = "Несовпадение имени хоста";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Ожидает подтверждения";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Удалить навсегда";

/* Label for button to open up photo library and choose photo */
"Photo Library" = "Photo Library";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Сохраненные сертификаты";

/* Label for messages that are not encrypted */
"plaintext" = "plaintext";

/* No comment provided by engineer. */
"Plaintext (Opportunistic OTR)" = "Plaintext (Opportunistic OTR)";

/* No comment provided by engineer. */
"Plaintext Only" = "Plaintext Only";

/* detail title label for invalid email */
"Please choose a valid email address" = "Укажите корректный e-mail";

/* Label for port number field for connecting to service */
"Port" = "Порт";

/* title for contacts profile view */
"Profile" = "Profile";

/* Title for push-messaging related settings */
"Push" = "Push";

/* Label for qr code image */
"QR code" = "QR код";

/* Error string for OTR message string */
"Received a general OTR error." = "Общая ошибка шифрования";

/* Error string for OTR message string */
"Received a heartbeat." = "Получен heartbeat";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Невозможно прочитать зашифрованное сообщение, приватный диалог не создан";

/* Error string for OTR message string */
"Received an unencrypted message." = "Получено нешифрованное сообщение";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Сообщение адресовано другому приложению";

/* Error string for OTR message string */
"Received our own OTR messages." = "Получено наше собственное сообщение";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Недавние";

/* SSL error message */
"Record overflow" = "Переполнение записи";

/* Button title to reject a request such as a buddy request */
"Reject" = "Отклонить";

/* Label for instruction to delete current recording */
"Release to delete" = "Release to delete";

/* Label for instruction to send current audio */
"Release to send" = "Release to send";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Сохранить";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Запомнить пароль";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Удалить";

/* No comment provided by engineer. */
"Removed By Server" = "Removed By Server";

/* Reply to an incoming message */
"Reply" = "Ответ";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Требуется";

/* Label for button to resend message. */
"Resend" = "Resend";

/* Ttitle for alert view to resend a message */
"Resend Message" = "Resend Message";

/* Describe what resending will do the %@ will be replaced withe the method OTR/OMEMO/Plaintext */
"Resending this message will use %@." = "Resending this message will use %@.";

/* Label for text input for XMPP resource */
"Resource" = "Ресурс";

/* Title for button for saving a setting */
"Save" = "Сохранить";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Сертификаты";

/* Label for sharing via QR Code */
"Scan QR" = "Scan QR";

/* Label for text field where you search for a buddy */
"Search" = "Поиск";

/* Title heading in settings */
"Security" = "Безопасность";

/* Title of alert box warning about security issues */
"Security Warning" = "Предупреждение о безопасности";

/* The placeholder text in the chat view where the message should go */
"Send %@ encrypted message" = "Send %@ encrypted message";

/* String on button to email feedback */
"Send Feedback" = "Обратная связь";

/* The placeholder text in the chat view where the message should go */
"Send plaintext message" = "Send plaintext message";

/* Label text for when a transfer is in progress (normally followed by a percent value 34%) */
"Sending" = "Sending";

/* Error string for OTR message string */
"Sent a heartbeat." = "Отправить heartbeat";

/* server selection section title */
"Server" = "Server";

/* SSL error message */
"Server closed session with no notification" = "Сервер завершил соединение";

/* SSL error message */
"Server has requested a client cert" = "Сервер запросил клиентский сертификат";

/* Title for the Settings screen */
"Settings" = "Настройки";

/* Title for sharing a link to the app */
"Share" = "Поделиться";

/* Label for inviting friends via URL */
"Share Invite" = "Share Invite";

/* No comment provided by engineer. */
"Show Advanced Encryption Settings" = "Show Advanced Encryption Settings";

/* toggle switch for show advanced */
"Show Advanced Options" = "Show Advanced Options";

/* title label for signing up for a new account */
"Sign Up" = "Создать аккаунт";

/* Label for button to skip this step */
"Skip" = "Пропустить";

/* A placeholder for a buddy's username like Someone wants to chat. */
"Someone" = "Someone";

/* SSL error message */
"SSL protocol error" = "Ошибка SSL";

/* Label for button to take a photo from camera */
"Take Photo" = "Take Photo";

/* No comment provided by engineer. */
"The app crashed last time it was launched. Send a crash report?" = "The app crashed last time it was launched. Send a crash report?";

/* Error string for OTR message string */
"The message received contains malformed data." = "Сообщение содержит неверные данные";

/* Error string for OTR message string */
"The previous message was resent." = "Сообщение было отправлено повторно";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "Сервер XMPP не поддерживает регистрацию";

/* basic setup selection footer */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "Устройство не настроено для совершения платежей";

/* Error message description */
"This message was received from an untrusted device." = "This message was received from an untrusted device.";

/* Error message description */
"This message was sent to an untrusted device." = "This message was sent to an untrusted device.";

/* microphone permission is disabled */
"To use this feature you must re-enable microphone permissions." = "To use this feature you must re-enable microphone permissions.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Поддержка Tor экспериментальна, используйте с осторожностью";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* Title for error message */
"Unable to Send Message" = "Unable to Send Message";

/* SSL error message */
"Underlying cryptographic error" = "Внутренняя ошибка криптографии";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Неверная(пропущенная) запись DTLS";

/* SSL error message */
"Unexpected message received" = "Получено неверное сообщение";

/* SSL error message */
"Unknown Cert Authority" = "Неизвестный центр сертификации";

/* SSL error message */
"Unknown certificate" = "Неизвестный сертификат";

/* Describes an error without a known cause */
"Unknown Error" = "Unknown Error";

/* Label for button to unlock app */
"Unlock" = "Разблокировать";

/* shown when invite QR code doesnt work */
"Unrecognized Invite Format" = "Unrecognized Invite Format";

/* Title for error message */
"Untrusted Device" = "Untrusted Device";

/* SSL error message */
"User canceled" = "Отмена пользователем";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "Имя пользователя";

/* SSL error message */
"Valid cert chain, untrusted root" = "Корректная цепочка, недоверенный корневой сертификат";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Корректный сертификат";

/* To let the user know the fingerprint as been checked */
"Verified" = "Проверен";

/* Shown when verifying fingerprints */
"Verify" = "Проверить";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Проверить отпечаток";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Версия";

/* The label for a button to view the buddy profile */
"View Profile" = "View Profile";

/* Describe how to change a contact's device settings */
"View profile to review contact's devices or change encryption settings." = "View profile to review contact's devices or change encryption settings.";

/* Label text for when a transfer has not started yet */
"Waiting" = "Waiting";

/* This string follows a user's dislplay name or username ex Bob wants to chat. */
"wants to chat." = "wants to chat.";

/* help text for password generator */
"We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else." = "We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this account." = "We could not find any trusted devices for this account.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this contact." = "We could not find any trusted devices for this contact.";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Подключиться к UserVoice для отправки отзыва?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* String used when onboarding works */
"You're ready to use" = "You're ready to use";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "Ваше пожертвование поможет продолжить разработку ChatSecure";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "Пароль будет сохранен в Связке Ключей iOS только этого устройства, и безопасен, пока безопасна парольная фраза устройства и пин-код. В то же время, он не сохранится после восстановления устройства из iTunes, пожалуйста, не забудьте его, или вы можете потерять историю сообщений";

